examples/openfoam_airfoil/airfoil_tuner_opt/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14336
(
453.135
366.57
296.578
239.986
194.228
157.231
127.317
103.13
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
224
(
453.312
367.09
297.77
243.131
201.764
172.026
151.478
137.459
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
501
501
501
501
501
501
501
501
...
)
;
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.997891
0.993353
0.988131
0.982129
0.975244
0.967362
0.958359
0.9481
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
