examples/openfoam_airfoil/airfoil_tuner_opt/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1402";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14336
(
0.0289148
0.0470915
0.0958754
0.136641
0.184235
0.237706
0.301067
0.377195
...
)
;

boundaryField
{
    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           nonuniform List<scalar> 
224
(
0.0452505
0.127845
0.189277
0.225205
0.244116
0.253423
0.259311
0.264319
...
)
;
    }
    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           nonuniform List<scalar> 
128
(
0.000223886
0.000224087
0.000223704
0.00022427
0.000223564
0.00022441
0.000223461
0.000224513
...
)
;
    }
    airfoil
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
